# GetActiveServerIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultiServerService..::..GetActiveServerIds Method
MultiServerService Class See Also
---
Returns Ids of the currently active application-level servers registered for the service.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IList<Guid> GetActiveServerIds()
```

Visual Basic
---
```text
Public Function GetActiveServerIds As IList(Of Guid)
```

Visual C++
---
```text
public:
IList<Guid>^ GetActiveServerIds()
```

# ### Return Value
A set of GUIDs of the application-wide active servers; the list may be empty.
# Remarks
More than one application-level server can be active at a given time in a multi-server service, but it is possible that no server is active (unless the service is mandatory).
# See Also
MultiServerService Class
GetActiveServerIds Overload
Autodesk.Revit.DB.ExternalService Namespace